case/multiBeam-FloatingObject/constant/beamthree/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    left
    {
        type            patch;
        nFaces          1;
        startFace       19;
    }
    right
    {
        type            patch;
        nFaces          1;
        startFace       20;
    }
    beam
    {
        type            empty;
        nFaces          640;
        startFace       21;
    }
)


// ************************************************************************* //
