case/multiBeam-FloatingObject/constant/beamtwo/timeVsDisplacement
(
    ( 0 (0 0 0))
   // ( 10 (-23.5606 -13.6046 53.4744) )
   ( 0.6 (-0.0164442523327 -0.0184724786946 0.00357024504488) )

)
