case/multiBeam-FloatingObject/0.org/beamfour/W
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      DW;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    left
    {
        type fixedValue;
        value uniform (0 0 0);
    }

//    right
//    {
//        type forceBeamDisplacementNR;
//        value uniform (0 0 0);
//        // force uniform (0 0 0);
        
//        forceSeries
//        {
//            fileName        "$FOAM_CASE/constant/timeVsForce";
//            outOfBounds     clamp;
//        }
//    }
    
         right
     {
        type fixedValue;//fixedDisplacement;
        value uniform (0 0 0);
        
        //value  uniform (-0.0164442523327 -0.0184724786946 0.00357024504488);
        
        //displacementSeries
       // {
          //   fileName        "$FOAM_CASE/constant/beam/timeVsDisplacement";
        // outOfBounds     clamp;
       // }
    // }
     }
     

    beam
    {
        type empty;
    }
}


// ************************************************************************* //
