case/multiBeam-FloatingObject/0.org/pointDisplacement
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    location    "0.01";
    object      pointDisplacement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    stationaryWalls
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    atmosphere
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    floatingObject
    {
        type            finiteVolumeBeamDisplacement;//fixedValue;
        value           uniform (0 0 0);
         type            finiteVolumeBeamDisplacement;
         centreOfMass    (0.5 0.5 0.5);
        momentOfInertia (0.08622222 0.08622222 0.144);
        mass            9.6;
        rhoInf          1;
        report          on;
	 constraints
         {

         }
         restraints
         {
             verticalSpring1
             {
                 sixDoFRigidBodyMotionRestraintNew finiteVolumeBeamRestraint;
		
                 attachmentPatch right;
		

                  finiteVolumeBeamRestraintCoeffs
                  {
			    beamRegion	"beamone";
                refAttachmentPt (0.35 0.35 0.44);
               
                  }
             }
             verticalSpring2
             {
                 sixDoFRigidBodyMotionRestraintNew finiteVolumeBeamRestraint;
		
                 attachmentPatch right;
		

                  finiteVolumeBeamRestraintCoeffs
                  {
			    beamRegion	"beamtwo";
                refAttachmentPt (0.35 0.65 0.44);
               
                  }
             }
             verticalSpring3
             {
                 sixDoFRigidBodyMotionRestraintNew finiteVolumeBeamRestraint;
		
                 attachmentPatch right;
		

                  finiteVolumeBeamRestraintCoeffs
                  {
			    beamRegion	"beamthree";
                refAttachmentPt (0.65 0.35 0.44);
               
                  }
             }
            //  verticalSpring4
            //  {
            //      sixDoFRigidBodyMotionRestraintNew finiteVolumeBeamRestraint;
		
            //      attachmentPatch right;
		

            //       finiteVolumeBeamRestraintCoeffs
            //       {
			//     beamRegion	"beamfour";
            //     refAttachmentPt (0.65 0.65 0.44);
               
            //       }
            //  }
         }



         value           uniform (0 0 0);
    }
}


// ************************************************************************* //
